Revit 2027 API
ParameterTypeId.IfcImportMaterialName Property
 "IFC Material Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId IfcImportMaterialName { get; }
Public Shared ReadOnly Property IfcImportMaterialName As ForgeTypeId
	Get
public:
static property ForgeTypeId^ IfcImportMaterialName {
	ForgeTypeId^ get ();
}
static member IfcImportMaterialName : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace